Tekla Open API Reference for Tekla Structures 2025
Assembly.GetAssemblyType Method
 Returns the type of the assembly.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Assembly.AssemblyTypeEnum GetAssemblyType()
Public Function GetAssemblyType As Assembly.AssemblyTypeEnum
Return Value
Type: Assembly.AssemblyTypeEnum
The type of the assembly.
See Also
Reference
Assembly Class
Tekla.Structures.Model Namespace